Tekla Open API Reference for Tekla Structures 2025
BoltGroup.GetSolid Method
 Method for getting the solid information of the bolt group.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Solid GetSolid()
Public Function GetSolid As Solid
Return Value
Type: Solid
The solid instance of the bolt group.
See Also
Reference
BoltGroup Class
GetSolid Overload
Tekla.Structures.Model Namespace